{
    "0": "Hi students, this is Alex here. In this video, we are going to discuss about how to evaluate divergence and curve. Before that, let's discuss about some of the basics. The first basic is scalar product or dot product of two vectors. Suppose, if we have k vector, which is k1 i vector plus a2 j vector plus a3 k vector and there is another vector b vector, which is the same way b1 i vector plus b2 j vector plus b3 k vector. If we want to evaluate, the scalar product or dot product, we write it as a vector dot b vector. We have to multiply",
    "1": "the corresponding coefficients of i and i. So, that will give us a1 b1. Similarly, coefficients of j, if we multiply, we get a2 b2 and coefficients of k, if we multiply a3 b3. In the same way, if you want to find the vector product, there is also one as a cross product of two vectors, then we write it as a vector cross b vector. To evaluate this, we are going to use the determinant. So, let's open the determinant. In the first row, we have to write i vector j vector k vector and in the second row, the confidence of a vector, which is a1, a2, a3 and a third row, the confidence of b",
    "2": "vector is b1 b2 b3 determinant closing. We are evaluating this determinant, we get the value of a cross b. So, in this, we have discussed about how to evaluate the dot product and how to evaluate the cross product. Now, coming to our topic, divergence. So, divergence of f vector is nothing but it is a dot product between del and f vector. So, since it is a dot product, it is a scalar quantity and we also know the del is i vector into dou by dou x plus j vector into dou by dou y plus k vector into dou by dou z.",
    "3": "With this, we have to do dot product of f vector. f vector is f1 i vector plus f2 j vector plus f3 k vector. As we discussed here, how to evaluate the dot product, cross body coefficients of i and i j and j and k and k will multiply. So, here by doing so, we have to take first term i and multiply it together, we get dou f1 by dou x. In the same way, the second term is the second term, we get dou f2 by dou y and third term will be dou f3 by dou z. Next, we will see how to evaluate the curve. Suppose, if I want to evaluate curve f vector, it is nothing but it is a cross product",
    "4": "between del and f vector. And already we know del is i into dou by dou x plus j into dou by dou by dou y plus k into dou by dou z with this cross product with f vector. f vector is f1 i vector plus f2 j vector plus f3 k vector. Here, we discussed about how to evaluate the cross product using the determinant. In the same way, we have to open a determinant. In the determinant, in the first row, we have i vector j vector and k vector. In second row, we have dou by dou x dou by dou y",
    "5": "dou by dou z. And in the third row, we have the components of f, which is f1, f2, f3 and close the determinant."
}